fixture/vcr_cassettes/charge/get.json

[
  {
    "request": {
      "body": "\"\"",
      "headers": {
        "Content-Type": "application/json;charset=UTF-8",
        "Authorization": "***"
      },
      "method": "get",
      "options": {
        "ssl_options": {
          "versions": [
            "tlsv1.2",
            "tlsv1.1",
            "tlsv1"
          ]
        },
        "recv_timeout": 30000
      },
      "request_body": "",
      "url": "https://api.sandbox.checkout.com/payments/pay_5dj3tyjoawpe3crfc7k2kvx7ye"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"pay_5dj3tyjoawpe3crfc7k2kvx7ye\",\"requested_on\":\"2020-06-02T12:31:03Z\",\"source\":{\"id\":\"src_en2w67spfevehol7rh6m5zokeq\",\"type\":\"card\",\"expiry_month\":8,\"expiry_year\":2022,\"name\":\"Arno de Jonge\",\"scheme\":\"Visa\",\"last4\":\"4242\",\"fingerprint\":\"D56493F0C6628BCE0B579D0C36A560DE55957099EFA6642086029366C4685B40\",\"bin\":\"424242\",\"card_type\":\"Credit\",\"card_category\":\"Consumer\",\"issuer\":\"JPMORGAN CHASE BANK NA\",\"issuer_country\":\"US\",\"product_id\":\"A\",\"product_type\":\"Visa Traditional\",\"avs_check\":\"S\",\"cvv_check\":\"Y\",\"payouts\":true,\"fast_funds\":\"d\"},\"amount\":2500,\"currency\":\"HUF\",\"payment_type\":\"Moto\",\"reference\":\"\",\"description\":\"\",\"status\":\"Refunded\",\"approved\":true,\"risk\":{\"flagged\":false},\"customer\":{\"id\":\"cus_lmxvhq5nzgmudlm2ovnxpzsig4\",\"email\":\"arno.de.jonge@gmail.com\",\"name\":\"Arno de Jonge\"},\"billing_descriptor\":{\"name\":\"\",\"city\":\"London\"},\"shipping\":{},\"payment_ip\":\"80.99.123.13\",\"metadata\":{\"Udf1\":\"\"},\"eci\":\"05\",\"scheme_id\":\"522366173655939\",\"_links\":{\"self\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_5dj3tyjoawpe3crfc7k2kvx7ye\"},\"actions\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_5dj3tyjoawpe3crfc7k2kvx7ye/actions\"}}}",
      "headers": {
        "Date": "Thu, 04 Jun 2020 08:37:49 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "1158",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "Access-Control-Allow-Headers": "Origin,X-Requested-With,Content-Type,Accept,X-AuthToken,Access-Control-Request-Method,Access-Control-Allow-Methods,Access-Control-Request-Headers,authorization,X_Auth_Credentials",
        "Access-Control-Allow-Methods": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Allow-Origin": "*",
        "Product": "Gateway",
        "Cko-Version": "3.38.3",
        "Cko-Request-Id": "8b258e0d-bd57-4616-ba5b-51cc4ec5a281",
        "Access-Control-Request-Method": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Request-Headers": "authorization"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]