fixture/vcr_cassettes/payment/create_with_default.json

[
  {
    "request": {
      "body": "{\"amount\":100,\"currency\":\"USD\",\"source\":{\"email\":\"test@example.org\",\"type\":\"customer\"}}",
      "headers": {
        "Content-Type": "application/json;charset=UTF-8",
        "Authorization": "***"
      },
      "method": "post",
      "options": {
        "ssl_options": {
          "versions": [
            "tlsv1.2",
            "tlsv1.1",
            "tlsv1"
          ]
        },
        "recv_timeout": 30000
      },
      "request_body": "",
      "url": "https://api.sandbox.checkout.com/payments"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"pay_mhhacwgbshbuvj3zrcoijq35se\",\"action_id\":\"act_mhhacwgbshbuvj3zrcoijq35se\",\"amount\":100,\"currency\":\"USD\",\"approved\":true,\"status\":\"Authorized\",\"auth_code\":\"428477\",\"eci\":\"05\",\"scheme_id\":\"193931073132370\",\"response_code\":\"10000\",\"response_summary\":\"Approved\",\"risk\":{\"flagged\":false},\"source\":{\"id\":\"src_en2w67spfevehol7rh6m5zokeq\",\"type\":\"card\",\"expiry_month\":8,\"expiry_year\":2022,\"name\":\"Arno de Jonge\",\"scheme\":\"Visa\",\"last4\":\"4242\",\"fingerprint\":\"D56493F0C6628BCE0B579D0C36A560DE55957099EFA6642086029366C4685B40\",\"bin\":\"424242\",\"card_type\":\"Credit\",\"card_category\":\"Consumer\",\"issuer\":\"JPMORGAN CHASE BANK NA\",\"issuer_country\":\"US\",\"product_id\":\"A\",\"product_type\":\"Visa Traditional\",\"avs_check\":\"S\",\"cvv_check\":\"Y\",\"payouts\":true,\"fast_funds\":\"d\"},\"customer\":{\"id\":\"cus_lmxvhq5nzgmudlm2ovnxpzsig4\",\"email\":\"test@example.org\",\"name\":\"Arno de Jonge\"},\"processed_on\":\"2020-06-04T10:00:17Z\",\"processing\":{\"acquirer_transaction_id\":\"1280979653\",\"retrieval_reference_number\":\"131250158906\"},\"_links\":{\"self\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_mhhacwgbshbuvj3zrcoijq35se\"},\"actions\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_mhhacwgbshbuvj3zrcoijq35se/actions\"},\"capture\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_mhhacwgbshbuvj3zrcoijq35se/captures\"},\"void\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_mhhacwgbshbuvj3zrcoijq35se/voids\"}}}",
      "headers": {
        "Date": "Thu, 04 Jun 2020 10:00:17 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "1409",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "Location": "https://api.sandbox.checkout.com/payments/pay_mhhacwgbshbuvj3zrcoijq35se",
        "Access-Control-Allow-Headers": "Origin,X-Requested-With,Content-Type,Accept,X-AuthToken,Access-Control-Request-Method,Access-Control-Allow-Methods,Access-Control-Request-Headers,authorization,X_Auth_Credentials",
        "Access-Control-Allow-Methods": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Allow-Origin": "*",
        "Product": "Gateway",
        "Cko-Version": "3.38.3",
        "Cko-Request-Id": "3b51b243-ba34-4eee-96fa-980f6ba64bf0",
        "Access-Control-Request-Method": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Request-Headers": "authorization"
      },
      "status_code": 201,
      "type": "ok"
    }
  }
]
