fixture/vcr_cassettes/payment/create_with_full_card.json

[
  {
    "request": {
      "body": "{\"amount\":100,\"currency\":\"USD\",\"source\":{\"cvv\":100,\"expiry_month\":\"08\",\"expiry_year\":\"2022\",\"number\":\"4242424242424242\",\"type\":\"card\"}}",
      "headers": {
        "Content-Type": "application/json;charset=UTF-8",
        "Authorization": "***"
      },
      "method": "post",
      "options": {
        "ssl_options": {
          "versions": [
            "tlsv1.2",
            "tlsv1.1",
            "tlsv1"
          ]
        },
        "recv_timeout": 30000
      },
      "request_body": "",
      "url": "https://api.sandbox.checkout.com/payments"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"pay_iq544ielcidujpbjfevthxdrkq\",\"action_id\":\"act_iq544ielcidujpbjfevthxdrkq\",\"amount\":100,\"currency\":\"USD\",\"approved\":true,\"status\":\"Authorized\",\"auth_code\":\"274304\",\"eci\":\"05\",\"scheme_id\":\"255754969949026\",\"response_code\":\"10000\",\"response_summary\":\"Approved\",\"risk\":{\"flagged\":false},\"source\":{\"id\":\"src_46lc3kmeffse5ilyh5n3rfmnqu\",\"type\":\"card\",\"expiry_month\":8,\"expiry_year\":2022,\"scheme\":\"Visa\",\"last4\":\"4242\",\"fingerprint\":\"D56493F0C6628BCE0B579D0C36A560DE55957099EFA6642086029366C4685B40\",\"bin\":\"424242\",\"card_type\":\"Credit\",\"card_category\":\"Consumer\",\"issuer\":\"JPMORGAN CHASE BANK NA\",\"issuer_country\":\"US\",\"product_id\":\"A\",\"product_type\":\"Visa Traditional\",\"avs_check\":\"S\",\"cvv_check\":\"Y\",\"payouts\":true,\"fast_funds\":\"d\"},\"customer\":{\"id\":\"cus_wmno2sknmy2upmznqqi3xnbfji\"},\"processed_on\":\"2020-06-04T09:46:39Z\",\"processing\":{\"acquirer_transaction_id\":\"1499208307\",\"retrieval_reference_number\":\"614995754651\"},\"_links\":{\"self\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_iq544ielcidujpbjfevthxdrkq\"},\"actions\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_iq544ielcidujpbjfevthxdrkq/actions\"},\"capture\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_iq544ielcidujpbjfevthxdrkq/captures\"},\"void\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_iq544ielcidujpbjfevthxdrkq/voids\"}}}",
      "headers": {
        "Date": "Thu, 04 Jun 2020 09:46:39 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "1329",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "Location": "https://api.sandbox.checkout.com/payments/pay_iq544ielcidujpbjfevthxdrkq",
        "Access-Control-Allow-Headers": "Origin,X-Requested-With,Content-Type,Accept,X-AuthToken,Access-Control-Request-Method,Access-Control-Allow-Methods,Access-Control-Request-Headers,authorization,X_Auth_Credentials",
        "Access-Control-Allow-Methods": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Allow-Origin": "*",
        "Product": "Gateway",
        "Cko-Version": "3.38.3",
        "Cko-Request-Id": "f1ea332d-b0ef-4745-995d-3cdf5534208f",
        "Access-Control-Request-Method": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Request-Headers": "authorization"
      },
      "status_code": 201,
      "type": "ok"
    }
  }
]