fixture/vcr_cassettes/payment/create_with_id.json

[
  {
    "request": {
      "body": "{\"amount\":6500,\"currency\":\"USD\",\"source\":{\"cvv\":\"100\",\"id\":\"src_en2w67spfevehol7rh6m5zokeq\",\"type\":\"id\"}}",
      "headers": {
        "Content-Type": "application/json;charset=UTF-8",
        "Authorization": "***"
      },
      "method": "post",
      "options": {
        "ssl_options": {
          "versions": [
            "tlsv1.2",
            "tlsv1.1",
            "tlsv1"
          ]
        },
        "recv_timeout": 30000
      },
      "request_body": "",
      "url": "https://api.sandbox.checkout.com/payments"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"pay_djhoqqy5wtfulfqqq342vr22ry\",\"action_id\":\"act_djhoqqy5wtfulfqqq342vr22ry\",\"amount\":6500,\"currency\":\"USD\",\"approved\":true,\"status\":\"Authorized\",\"auth_code\":\"233963\",\"eci\":\"05\",\"scheme_id\":\"983109360560922\",\"response_code\":\"10000\",\"response_summary\":\"Approved\",\"risk\":{\"flagged\":false},\"source\":{\"id\":\"src_en2w67spfevehol7rh6m5zokeq\",\"type\":\"card\",\"expiry_month\":8,\"expiry_year\":2022,\"name\":\"Arno de Jonge\",\"scheme\":\"Visa\",\"last4\":\"4242\",\"fingerprint\":\"D56493F0C6628BCE0B579D0C36A560DE55957099EFA6642086029366C4685B40\",\"bin\":\"424242\",\"card_type\":\"Credit\",\"card_category\":\"Consumer\",\"issuer\":\"JPMORGAN CHASE BANK NA\",\"issuer_country\":\"US\",\"product_id\":\"A\",\"product_type\":\"Visa Traditional\",\"avs_check\":\"S\",\"cvv_check\":\"Y\",\"payouts\":true,\"fast_funds\":\"d\"},\"customer\":{\"id\":\"cus_lmxvhq5nzgmudlm2ovnxpzsig4\",\"email\":\"arno.de.jonge@gmail.com\",\"name\":\"Arno de Jonge\"},\"processed_on\":\"2020-06-04T09:28:25Z\",\"processing\":{\"acquirer_transaction_id\":\"3065201022\",\"retrieval_reference_number\":\"331103022399\"},\"_links\":{\"self\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_djhoqqy5wtfulfqqq342vr22ry\"},\"actions\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_djhoqqy5wtfulfqqq342vr22ry/actions\"},\"capture\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_djhoqqy5wtfulfqqq342vr22ry/captures\"},\"void\":{\"href\":\"https://api.sandbox.checkout.com/payments/pay_djhoqqy5wtfulfqqq342vr22ry/voids\"}}}",
      "headers": {
        "Date": "Thu, 04 Jun 2020 09:28:25 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "1410",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "Location": "https://api.sandbox.checkout.com/payments/pay_djhoqqy5wtfulfqqq342vr22ry",
        "Access-Control-Allow-Headers": "Origin,X-Requested-With,Content-Type,Accept,X-AuthToken,Access-Control-Request-Method,Access-Control-Allow-Methods,Access-Control-Request-Headers,authorization,X_Auth_Credentials",
        "Access-Control-Allow-Methods": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Allow-Origin": "*",
        "Product": "Gateway",
        "Cko-Version": "3.38.3",
        "Cko-Request-Id": "74d31c23-7135-4347-ba98-cb88516e9f1e",
        "Access-Control-Request-Method": "OPTIONS,POST,GET,PUT,DELETE",
        "Access-Control-Request-Headers": "authorization"
      },
      "status_code": 201,
      "type": "ok"
    }
  }
]